In [2]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
df = pd.read_csv('encoding_practice_dataset.csv')

In [3]:
df.select_dtypes(include='object').columns
#df.select_dtypes(include='object').columns
#this step is optional for small dataseta but for bigger datasets , its needed to know the nature of cilumn

Index(['user_id', 'gender', 'education_level', 'job_role', 'city',
       'marital_status', 'device_type', 'subscription_plan', 'payment_method'],
      dtype='object')

In [4]:
le = LabelEncoder()

In [5]:
df['education_level'] = le.fit_transform(df['education_level'])

In [7]:
df

,user_id,gender,education_level,job_role,city,marital_status,device_type,subscription_plan,payment_method,monthly_income,tenure_months,churn
0,U1,Male,2,Sales,City_38,Divorced,Mobile,Standard,Wallet,37784,24,0
1,U2,Female,0,Doctor,City_18,Married,Tablet,Standard,UPI,127167,27,0
2,U3,Female,3,Sales,City_26,Married,Tablet,Free,Cash,82359,37,1
3,U4,Female,0,Consultant,City_6,Widowed,Mobile,Standard,Wallet,93608,39,0
4,U5,Male,3,HR,City_4,Divorced,Laptop,Premium,Net Banking,30111,63,0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,U996,Male,0,Technician,City_11,Divorced,Mobile,Standard,Net Banking,134694,56,0
996,U997,Female,4,Teacher,City_32,Divorced,Tablet,Standard,Credit Card,147631,59,0
997,U998,Male,2,Doctor,City_11,Single,Mobile,Free,Cash,65893,63,0
998,U999,Female,2,Sales,City_18,Single,Mobile,Basic,Net Banking,30167,59,1
999,U1000,Male,1,Sales,City_27,Married,Tablet,Free,Wallet,53598,51,1

In [7]:
le.classes_

array(['Bachelor', 'Diploma', 'High School', 'Master', 'PhD'],
      dtype=object)

In [8]:
df

,user_id,gender,education_level,job_role,city,marital_status,device_type,subscription_plan,payment_method,monthly_income,tenure_months,churn
0,U1,Male,2,Sales,City_38,Divorced,Mobile,Standard,Wallet,37784,24,0
1,U2,Female,0,Doctor,City_18,Married,Tablet,Standard,UPI,127167,27,0
2,U3,Female,3,Sales,City_26,Married,Tablet,Free,Cash,82359,37,1
3,U4,Female,0,Consultant,City_6,Widowed,Mobile,Standard,Wallet,93608,39,0
4,U5,Male,3,HR,City_4,Divorced,Laptop,Premium,Net Banking,30111,63,0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,U996,Male,0,Technician,City_11,Divorced,Mobile,Standard,Net Banking,134694,56,0
996,U997,Female,4,Teacher,City_32,Divorced,Tablet,Standard,Credit Card,147631,59,0
997,U998,Male,2,Doctor,City_11,Single,Mobile,Free,Cash,65893,63,0
998,U999,Female,2,Sales,City_18,Single,Mobile,Basic,Net Banking,30167,59,1
999,U1000,Male,1,Sales,City_27,Married,Tablet,Free,Wallet,53598,51,1